// Напишите программу вычисления модуля числа.

Console.WriteLine("Write a number: ");
int a = int.Parse(Console.ReadLine());

int b = Math.Abs(a);
Console.WriteLine($"{b}");
